tutorials/incompressible/MRFSimpleFoam/axialTurbine/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    GVINLET
    {
        type            fixedValue;
        value           uniform (0 0 -1);
    }
    GVOUTLET
    {
        type            ggi;
    }
    GVCYCLIC1
    {
        type            cyclicGgi;
    }
    GVCYCLIC2
    {
        type            cyclicGgi;
    }
    GVBLADE
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    GVHUB
    {
        type            rotatingWallVelocity;
        origin          (0 0 0);
        axis            (0 0 1);
        omega           -10;
        value           uniform (0 0 0);
    }
    GVSHROUD
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    RUINLET
    {
        type            ggi;
    }
    RUOUTLET
    {
        type            ggi;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
    }
    RUBLADE
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    RUHUB
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    RUSHROUD
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    DTINLET
    {
        type            ggi;
    }
    DTOUTLET
    {
        type            zeroGradient;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
    }
    DTHUB
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    DTSHROUD
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
