tutorials/incompressible/MRFSimpleFoam/axialTurbine/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="MRFSimpleFoam"
#application="simpleFoam"

#Create the mesh:
./makeMesh

#Fix constant/boundary:
changeDictionary

# Set 0-directory and create GGI set:
cp -r 0_orig 0
setSet -batch setBatchGgi
setsToZones -noFlipMap

runApplication $application
